IDEA Open Model
BoltShearType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Defines a transfer of shear force in bolts.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum BoltShearType
Public Enumeration BoltShearType
Members
Member name | Value | Description
Bearing | 0 |  TODO DRA 1
Interaction | 1 |  TODO DRA 2
Friction | 2 |  TODO DRA 3
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace